app/controllers/game_sessions_controller.rb

        def create
            newSession = GameSession.create(name:(params[:name]), subject_id:(params[:subject_id]), score:(params[:score]))
---
INSERT INTO "game_sessions" ("score", "name", "created_at", "updated_at", "subject_id") VALUES (?, ?, ?, ?, ?)  [["score", 1], ["name", "seba"], ["created_at", "2019-12-21 02:23:20.182925"], ["updated_at", "2019-12-21 02:23:20.182925"], ["subject_id", 2]]