app/controllers/subjects_controller.rb

    def index
        subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

    def show
        subject = Subject.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]